; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v12)
             (pred_7 ?v7 ?v3)
             (pred_5 ?v8 ?v3)
             (pred_12 ?v9 ?v8 )
	     (pred_10 ?v8)
             (pred_9 ?v5)
             (pred_2 ?v7)
             (pred_8 ?v3)
             (pred_3 ?v8)
             (pred_1 ?v7)
             (pred_11 ?v8)
             (pred_6 ))



(:action op_2
:parameters (?v11 ?v10 ?v6 ?v13)
:precondition (and (pred_9 ?v11) (pred_9 ?v10) (pred_2 ?v6) (pred_8 ?v13)
          (pred_4 ?v11 ?v10) (pred_7 ?v6 ?v13)
                   (pred_5 ?v10 ?v13) (pred_10 ?v11) 
                   (pred_3 ?v10) (pred_1 ?v6))
:effect (and  (pred_11 ?v10) (not (pred_3 ?v10))))


(:action op_5
:parameters (?v11 ?v1)
:precondition (and (pred_9 ?v11) (pred_9 ?v1)
               (pred_10 ?v11) (pred_4 ?v11 ?v1) (pred_11 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v11))))

(:action op_3
:parameters (?v11 ?v6)
:precondition (and (pred_9 ?v11) (pred_2 ?v6) 
                  (pred_10 ?v11) (pred_12 ?v6 ?v11) (pred_6 ))
:effect (and (pred_1 ?v6)
   (not (pred_12 ?v6 ?v11)) (not (pred_6 ))))


(:action op_1
:parameters (?v11 ?v2 ?v4)
:precondition (and (pred_9 ?v11) (pred_2 ?v2) (pred_2 ?v4)
                  (pred_10 ?v11) (pred_1 ?v4) (pred_12 ?v2 ?v11))
:effect (and (pred_1 ?v2) (pred_12 ?v4 ?v11)
        (not (pred_1 ?v4)) (not (pred_12 ?v2 ?v11))))

(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_9 ?v11) (pred_2 ?v6) 
                  (pred_10 ?v11) (pred_1 ?v6))
:effect (and (pred_6 ) (pred_12 ?v6 ?v11) (not (pred_1 ?v6)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_10 obj_11 obj_12 obj_02 obj_01 obj_13 obj_05 obj_08
    obj_03 obj_06
    obj_07 obj_04
    )

    (:init
       (pred_6)

       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_01)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_2 obj_07)
       (pred_2 obj_04)

       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_02 obj_05)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_05 obj_02)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_08)
       (pred_5  obj_01 obj_03)
       (pred_5  obj_08 obj_06)
       (pred_11 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_05)

       (pred_7  obj_07 obj_03)
       (pred_7  obj_04 obj_06)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_04 obj_09)
       (pred_10 obj_05)
    )

    (:goal (and
       (pred_12 obj_07 obj_01)
    ))
(:constraints
  (always (not (pred_10 obj_10)))
)
)

; plan
1. (op_5 obj_05 obj_02)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_12)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_12)
   goals met: 0 of 1
3. (op_5 obj_12 obj_09)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_07)
   deleted: (pred_12 obj_07 obj_09) (pred_6)
   added: (pred_1 obj_07)
   goals met: 0 of 1
5. (op_5 obj_09 obj_12)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_12)
   goals met: 0 of 1
6. (op_5 obj_12 obj_02)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_02)
   goals met: 0 of 1
7. (op_2 obj_02 obj_01 obj_07 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_11 obj_01)
   goals met: 0 of 1
8. (op_5 obj_02 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_01)
   goals met: 0 of 1
9. (op_4 obj_01 obj_07)
   deleted: (pred_1 obj_07)
   added: (pred_6) (pred_12 obj_07 obj_01)
   goals met: 1 of 1
